In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
b = {'a':10,'b':20,'c':30}

In [5]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [6]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [7]:
pd.Series(data = b)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [10]:
w = ['USA','Germany','USSR','Japan']
l = [1,2,3,4]

ser1 = pd.Series(l,w)
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [11]:
ser1 = pd.Series([1,2,3,4],index = ['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [12]:
ser1['USA']

1

In [13]:
ser1[0]

1

In [14]:
from numpy.random import randn
np.random.seed(5)

df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [15]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [16]:
df['W']

A    0.441227
B    0.109610
C    0.187603
D   -0.358829
E    1.151391
Name: W, dtype: float64

In [17]:
df[['W','Z']]

          W         Z
A  0.441227 -0.252092
B  0.109610 -0.591637
C  0.187603 -0.204877
D -0.358829 -0.700179
E  1.151391  0.644848

In [18]:
df['new']= df['W']+df['Y']
df

          W         X         Y         Z       new
A  0.441227 -0.330870  2.430771 -0.252092  2.871999
B  0.109610  1.582481 -0.909232 -0.591637 -0.799623
C  0.187603 -0.329870 -1.192765 -0.204877 -1.005161
D -0.358829  0.603472 -1.664789 -0.700179 -2.023617
E  1.151391  1.857331 -1.511180  0.644848 -0.359789

Pandas의 dataframe을 통해 column 삭제

In [19]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

Inplace = True 라는 내용을 첨가해주면, df 의 내용에 절대적으로 영향을 미침.

In [20]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [21]:
df.drop('E')

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179

In [22]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179

In [23]:
df.shape

(5, 4)

In [24]:
df.loc[['A']]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [25]:
df.loc['A']

W    0.441227
X   -0.330870
Y    2.430771
Z   -0.252092
Name: A, dtype: float64

In [26]:
df.iloc[2]

W    0.187603
X   -0.329870
Y   -1.192765
Z   -0.204877
Name: C, dtype: float64

In [27]:
df.loc['B'].iloc[2]

-0.9092324048562419

In [28]:
df.loc['B','Y']

-0.9092324048562419

In [29]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.441227  2.430771
B  0.109610 -0.909232

In [30]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [31]:
df > 0

       W      X      Y      Z
A   True  False   True  False
B   True   True  False  False
C   True  False  False  False
D  False   True  False  False
E   True   True  False   True

In [32]:
df[df['W']>0]

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
E  1.151391  1.857331 -1.511180  0.644848

In [33]:
df[df["W"]>0][['Y']]

          Y
A  2.430771
B -0.909232
C -1.192765
E -1.511180

In [34]:
df[df["W"]>0][['X','Y']]

          X         Y
A -0.330870  2.430771
B  1.582481 -0.909232
C -0.329870 -1.192765
E  1.857331 -1.511180

In [35]:
df[df["W"]>0]['Y']

A    2.430771
B   -0.909232
C   -1.192765
E   -1.511180
Name: Y, dtype: float64

In [36]:
df[df['W']>0]
df[df['Y']>1]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [37]:
df[(df['W']>0) & (df['Y'] > 1)]

          W        X         Y         Z
A  0.441227 -0.33087  2.430771 -0.252092

In [43]:
score1 = [[40,30,60,100],[90,100,20,30],[50,20,90,99],[10,40,100,90]]
df_score = pd.DataFrame(score1, index = 'John Mary Peter Paul'.split(),columns = "Math Science English Coding".split())
# pd.DataFrame(data명, index, columns)
# pd.DataFrame(data를 산출하는 함수(사이즈), index, columns)

In [44]:
df_score

       Math  Science  English  Coding
John     40       30       60     100
Mary     90      100       20      30
Peter    50       20       90      99
Paul     10       40      100      90

In [45]:
df_score['총점'] = df_score['Math']+df_score['Science'] + df_score['English'] + df_score['Coding']

In [46]:
df_score

       Math  Science  English  Coding   총점
John     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240

In [47]:
df_score.loc['Titus']= [80, 30, 60, 90, 260]

In [48]:
df_score

       Math  Science  English  Coding   총점
John     40       30       60     100  230
Mary     90      100       20      30  240
Peter    50       20       90      99  259
Paul     10       40      100      90  240
Titus    80       30       60      90  260

In [50]:
df_score['Music']= [90, 30, 40, 20, 10]
df_score

       Math  Science  English  Coding   총점  Music
John     40       30       60     100  230     90
Mary     90      100       20      30  240     30
Peter    50       20       90      99  259     40
Paul     10       40      100      90  240     20
Titus    80       30       60      90  260     10

In [51]:
df_score.drop('총점',axis = 1,inplace = True)

In [53]:
df_score['총점'] = df_score['Math']+df_score['Science'] + df_score['English'] + df_score['Coding']+df_score['Music']
df_score

       Math  Science  English  Coding  Music   총점
John     40       30       60     100     90  320
Mary     90      100       20      30     30  270
Peter    50       20       90      99     40  299
Paul     10       40      100      90     20  260
Titus    80       30       60      90     10  270

In [56]:
df_score['평균'] = df_score['Math']+df_score['Science'] + df_score['English'] + df_score['Coding']+df_score['Music']/5
df_score

       Math  Science  English  Coding  Music     총점     평균
John     40       30       60     100     90  248.0  248.0
Mary     90      100       20      30     30  246.0  246.0
Peter    50       20       90      99     40  267.0  267.0
Paul     10       40      100      90     20  244.0  244.0
Titus    80       30       60      90     10  262.0  262.0

In [57]:
df_score[(df_score['Coding']>50) & (df_score['Math'] > 50)]

       Math  Science  English  Coding  Music     총점     평균
Titus    80       30       60      90     10  262.0  262.0

In [58]:
df

          W         X         Y         Z
A  0.441227 -0.330870  2.430771 -0.252092
B  0.109610  1.582481 -0.909232 -0.591637
C  0.187603 -0.329870 -1.192765 -0.204877
D -0.358829  0.603472 -1.664789 -0.700179
E  1.151391  1.857331 -1.511180  0.644848

In [59]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.441227 -0.330870  2.430771 -0.252092
1     B  0.109610  1.582481 -0.909232 -0.591637
2     C  0.187603 -0.329870 -1.192765 -0.204877
3     D -0.358829  0.603472 -1.664789 -0.700179
4     E  1.151391  1.857331 -1.511180  0.644848

In [60]:
newind = 'CA NY WY OR CO'.split()
df['States'] = newind
df

          W         X         Y         Z States
A  0.441227 -0.330870  2.430771 -0.252092     CA
B  0.109610  1.582481 -0.909232 -0.591637     NY
C  0.187603 -0.329870 -1.192765 -0.204877     WY
D -0.358829  0.603472 -1.664789 -0.700179     OR
E  1.151391  1.857331 -1.511180  0.644848     CO

In [61]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [62]:
df

          W         X         Y         Z States
A  0.441227 -0.330870  2.430771 -0.252092     CA
B  0.109610  1.582481 -0.909232 -0.591637     NY
C  0.187603 -0.329870 -1.192765 -0.204877     WY
D -0.358829  0.603472 -1.664789 -0.700179     OR
E  1.151391  1.857331 -1.511180  0.644848     CO

In [63]:
df.set_index("States",inplace = True)
df

               W         X         Y         Z
States
CA      0.441227 -0.330870  2.430771 -0.252092
NY      0.109610  1.582481 -0.909232 -0.591637
WY      0.187603 -0.329870 -1.192765 -0.204877
OR     -0.358829  0.603472 -1.664789 -0.700179
CO      1.151391  1.857331 -1.511180  0.644848

In [66]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [67]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [68]:
inside

[1, 2, 3, 1, 2, 3]

In [69]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [70]:
df = pd.DataFrame(np.random.randn(6,2), index = hier_index, columns = ['A','B'])
df

             A         B
G1 1 -0.980608 -0.856853
   2 -0.871879 -0.422508
   3  0.996440  0.712421
G2 1  0.059144 -0.363311
   2  0.003289 -0.105930
   3  0.793053 -0.631572

In [74]:
df.loc['G1']

          A         B
1 -0.980608 -0.856853
2 -0.871879 -0.422508
3  0.996440  0.712421

In [81]:
df.loc['G1'].iloc[0]

A   -0.980608
B   -0.856853
Name: 1, dtype: float64

In [89]:
df_score2 = pd.DataFrame(data = [[30,60],[100,50],[10,20],[90,80],[44,41],[70,77]],index = hier_index,columns = ['수학','영어'])
df_score2

       수학  영어
G1 1   30  60
   2  100  50
   3   10  20
G2 1   90  80
   2   44  41
   3   70  77

In [92]:
df_score2.loc["G1"].loc[1][1]

60

In [93]:
df_score2.loc["G2"].loc[2][0]

44

In [95]:
df_score2.loc["G1"].loc[1]['영어']

60

In [97]:
df_score2.loc["G2"].loc[2]['수학']

44

In [98]:
df_score2.index.names = ['반','번호']

In [99]:
df_score2

        수학  영어
반  번호
G1 1    30  60
   2   100  50
   3    10  20
G2 1    90  80
   2    44  41
   3    70  77

NameError: name 'nan' is not defined